#include <iostream>
using namespace std;

int main() {
	for( int i = 126; i <= 234; i++ )
	{
		if( i-(55499%i) <= 100 )
		{
			// n*m = 555xx（虫食い算の6段目を満たす）
			int n = i, m = 55599/i;

			// n*mで虫食い算を検証
			if( n >= 200 ) swap(n, m);
			int m100 = m/100, m10 = m/10%10, m1 = m%10;
			int d3 = n*m1, d4 = n*m10, d5 = n*m100; // 虫食い算の3,4,5段目の数
			int d3_100 = d3/100, d3_10 = d3/10%10, d3_1 = d3%10;
			int d4_100 = d4/100, d4_10 = d4/10%10, d4_1 = d4%10;
			int d5_100 = d5/100, d5_10 = d5/10%10, d5_1 = d5%10;
			if( d3_10 == 5 && d5_100 == 5 && d3_100 != 5 && d3_1 != 5 && d4_100 != 5 && d4_10 != 5 && d4_1 != 5 && d5_10 != 5 && d5_1 != 5 ) // 虫食い算の3,4,5段目を満たす
			{
				int n100 = n/100, n10 = n/10%10, n1 = n%10;
				if( n100 != 5 && n10 != 5 && n1 != 5 && m100 != 5 && m10 != 5 && m1 != 5 ) // 虫食い算の1,2段目を満たす
				{
					printf("Answer: %d × %d = %d\n", n, m, n*m);
				}
			}
		}
	}
}
